# DropTruss Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Truss..::..DropTruss Method
Truss Class See Also
---
Drop truss Family, it will disassociate all members from the truss and delete the truss.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public static void DropTruss(
	Truss truss
)
```

Visual Basic
---
```text
Public Shared Sub DropTruss ( _
	truss As Truss _
)
```

Visual C++
---
```text
public:
static void DropTruss(
	Truss^ truss
)
```

# ### Parameters
truss
    Type: Autodesk.Revit.DB.Structure..::..TrussThe truss to be dropped.
# See Also
Truss Class
Autodesk.Revit.DB.Structure Namespace